{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": null,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_dim": 3072,
  "id2label": {
    "0": "seek_support",
    "1": "book_appointment",
    "2": "crisis_emergency",
    "3": "information_request",
    "4": "feedback_complaint",
    "5": "general_chat",
    "6": "assessment_request"
  },
  "initializer_range": 0.02,
  "label2id": {
    "assessment_request": 6,
    "book_appointment": 1,
    "crisis_emergency": 2,
    "feedback_complaint": 4,
    "general_chat": 5,
    "information_request": 3,
    "seek_support": 0
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.3.0",
  "vocab_size": 30522
}
