{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": null,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_dim": 3072,
  "id2label": {
    "0": "anxiety",
    "1": "sadness",
    "2": "anger",
    "3": "fear",
    "4": "hopelessness",
    "5": "guilt",
    "6": "shame",
    "7": "neutral"
  },
  "initializer_range": 0.02,
  "label2id": {
    "anger": 2,
    "anxiety": 0,
    "fear": 3,
    "guilt": 5,
    "hopelessness": 4,
    "neutral": 7,
    "sadness": 1,
    "shame": 6
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.3.0",
  "vocab_size": 30522
}
